Revit 2026 API

# ContextualHelpHelpPath Property

---

The context id, help URL, or help file path.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string HelpPath { get; set; }
```
```vb
Public Property HelpPath As String
	Get
	Set
```
```cpp
public:
property String^ HelpPath {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member HelpPath : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when setting the help path to null or empty. |

#### Reference

ContextualHelp Class

Autodesk.Revit.UI Namespace